FastLED/FastLED/src/platforms/arm/nrf52/isr_nrf52.hpp
/*
  FastLED — NRF52 ISR Implementation
  -----------------------------------
  NRF52-specific implementation of the cross-platform ISR API.
  Supports NRF52832, NRF52833, NRF52840 (ARM Cortex-M4F).

  Uses Nordic nrfx HAL (Hardware Abstraction Layer) for timer and GPIOTE interrupts.

  Thread Safety & Critical Sections:
  - This implementation uses direct NVIC access (assumes NO SoftDevice)
  - When BLE SoftDevice is enabled, replace NVIC_* calls with sd_nvic_* equivalents
  - Nordic SDK provides CRITICAL_REGION_ENTER/EXIT macros for critical sections
  - CRITICAL_REGION uses ARM CPSID/CPSIE instructions (disables all interrupts)
  - For finer control, use BASEPRI register on Cortex-M4 (selective interrupt masking)
  - Avoid long critical sections to prevent interrupt latency issues

  SoftDevice Compatibility:
  - SoftDevice reserves NVIC priorities 0, 1, and 4 for BLE stack
  - Application interrupts at priority 0-3 CANNOT call SoftDevice APIs
  - Application interrupts at priority 5-7 CAN call SoftDevice APIs
  - Use software interrupts (SWIRQ) to defer work from high-priority ISRs

  License: MIT (FastLED)
*/

#pragma once

// IWYU pragma: private

#include "platforms/arm/nrf52/is_nrf52.h"

#if defined(FL_IS_NRF52)

#include "fl/stl/isr/handler.h"
#include "fl/stl/compiler_control.h"
#include "fl/stl/assert.h"
#include "fl/stl/unique_ptr.h"
#include "fl/log/log.h"

// Include NRF52 SDK headers
FL_EXTERN_C_BEGIN
#include <nrf.h>           // IWYU pragma: keep
#include <nrf_timer.h>     // IWYU pragma: keep
#include <nrf_gpiote.h>    // IWYU pragma: keep
#include <nrf_gpio.h>      // IWYU pragma: keep
#include "fl/stl/noexcept.h"

FL_EXTERN_C_END

namespace fl {
namespace isr {
namespace platforms {

// ArduinoCore-mbed ships Nordic's SDK 15 HAL, whose GPIOTE functions omit the
// peripheral argument and use the older plural event type. Keep those API
// differences isolated here so the ISR implementation also builds with the
// newer nrfx HAL used by the Adafruit nRF52 core.
#if FL_NRF52_USE_LEGACY_HAL
using fastled_nrf_gpiote_event_t = nrf_gpiote_events_t;

static bool fastled_gpiote_event_check(fastled_nrf_gpiote_event_t event) FL_NO_EXCEPT {
    return nrf_gpiote_event_is_set(event);
}

static void fastled_gpiote_event_clear(fastled_nrf_gpiote_event_t event) FL_NO_EXCEPT {
    nrf_gpiote_event_clear(event);
}

static void fastled_gpiote_event_configure(u32 channel, u32 pin,
                                           nrf_gpiote_polarity_t polarity) FL_NO_EXCEPT {
    nrf_gpiote_event_configure(channel, pin, polarity);
}

static void fastled_gpiote_event_enable(u32 channel) FL_NO_EXCEPT {
    nrf_gpiote_event_enable(channel);
}

static void fastled_gpiote_event_disable(u32 channel) FL_NO_EXCEPT {
    nrf_gpiote_event_disable(channel);
}

static void fastled_gpiote_int_enable(u32 mask) FL_NO_EXCEPT {
    nrf_gpiote_int_enable(mask);
}

static void fastled_gpiote_int_disable(u32 mask) FL_NO_EXCEPT {
    nrf_gpiote_int_disable(mask);
}

static void fastled_timer_cc_set(NRF_TIMER_Type* timer,
                                 nrf_timer_cc_channel_t channel,
                                 u32 value) FL_NO_EXCEPT {
    nrf_timer_cc_write(timer, channel, value);
}
#else
using fastled_nrf_gpiote_event_t = nrf_gpiote_event_t;

static bool fastled_gpiote_event_check(fastled_nrf_gpiote_event_t event) FL_NO_EXCEPT {
    return nrf_gpiote_event_check(NRF_GPIOTE, event);
}

static void fastled_gpiote_event_clear(fastled_nrf_gpiote_event_t event) FL_NO_EXCEPT {
    nrf_gpiote_event_clear(NRF_GPIOTE, event);
}

static void fastled_gpiote_event_configure(u32 channel, u32 pin,
                                           nrf_gpiote_polarity_t polarity) FL_NO_EXCEPT {
    nrf_gpiote_event_configure(NRF_GPIOTE, channel, pin, polarity);
}

static void fastled_gpiote_event_enable(u32 channel) FL_NO_EXCEPT {
    nrf_gpiote_event_enable(NRF_GPIOTE, channel);
}

static void fastled_gpiote_event_disable(u32 channel) FL_NO_EXCEPT {
    nrf_gpiote_event_disable(NRF_GPIOTE, channel);
}

static void fastled_gpiote_int_enable(u32 mask) FL_NO_EXCEPT {
    nrf_gpiote_int_enable(NRF_GPIOTE, mask);
}

static void fastled_gpiote_int_disable(u32 mask) FL_NO_EXCEPT {
    nrf_gpiote_int_disable(NRF_GPIOTE, mask);
}

static void fastled_timer_cc_set(NRF_TIMER_Type* timer,
                                 nrf_timer_cc_channel_t channel,
                                 u32 value) FL_NO_EXCEPT {
    nrf_timer_cc_set(timer, channel, value);
}
#endif

// =============================================================================
// Platform-Specific Handle Storage
// =============================================================================

struct nrf52_isr_handle_data {
    NRF_TIMER_Type* timer_instance;  // Timer peripheral instance (TIMER0-4)
    u8 timer_channel;           // Timer compare channel (0-5)
    IRQn_Type timer_irq;             // Timer IRQ number
    i8 gpiote_channel;           // GPIOTE channel (-1 if not GPIO)
    u8 gpio_pin;                // GPIO pin number (0xFF if not GPIO)
    bool is_timer;                   // true = timer ISR, false = external ISR
    bool is_enabled;                 // Current enable state
    isr_handler_t user_handler;      // User handler function
    void* user_data;                 // User context

    nrf52_isr_handle_data()
        : timer_instance(nullptr)
        , timer_channel(0)
        , timer_irq(static_cast<IRQn_Type>(0))
        , gpiote_channel(-1)
        , gpio_pin(0xFF)
        , is_timer(false)
        , is_enabled(true)
        , user_handler(nullptr)
        , user_data(nullptr)
    {}
};

// Platform ID for NRF52
constexpr u8 NRF52_PLATFORM_ID = 3;

// Maximum number of timer instances (TIMER0-TIMER4)
constexpr u8 MAX_TIMER_INSTANCES = 5;

// Maximum GPIOTE channels
constexpr u8 MAX_GPIOTE_CHANNELS = 8;

// Track allocated timers and GPIOTE channels
static bool timer_allocated[MAX_TIMER_INSTANCES][6] = {};  // [instance][channel]
static bool gpiote_allocated[MAX_GPIOTE_CHANNELS] = {};

// Storage for timer handles (to allow ISR to find user handler)
static nrf52_isr_handle_data* timer_handles[MAX_TIMER_INSTANCES][6] = {};
static nrf52_isr_handle_data* gpiote_handles[MAX_GPIOTE_CHANNELS] = {};

