FastLED/FastLED/src/platforms/arm/nrf52/isr_nrf52.hpp
// =============================================================================
// Helper Functions
// =============================================================================

// Get timer instance index (0-4) from pointer
static int get_timer_index(NRF_TIMER_Type* timer) FL_NO_EXCEPT {
    if (timer == NRF_TIMER0) return 0;
    if (timer == NRF_TIMER1) return 1;
    if (timer == NRF_TIMER2) return 2;
#ifdef NRF_TIMER3
    if (timer == NRF_TIMER3) return 3;
#endif
#ifdef NRF_TIMER4
    if (timer == NRF_TIMER4) return 4;
#endif
    return -1;
}

// Get timer pointer from index
static NRF_TIMER_Type* get_timer_instance(int index) FL_NO_EXCEPT {
    switch (index) {
        case 0: return NRF_TIMER0;
        case 1: return NRF_TIMER1;
        case 2: return NRF_TIMER2;
#ifdef NRF_TIMER3
        case 3: return NRF_TIMER3;
#endif
#ifdef NRF_TIMER4
        case 4: return NRF_TIMER4;
#endif
        default: return nullptr;
    }
}

// Get timer IRQ from index
static IRQn_Type get_timer_irq(int index) FL_NO_EXCEPT {
    switch (index) {
        case 0: return TIMER0_IRQn;
        case 1: return TIMER1_IRQn;
        case 2: return TIMER2_IRQn;
#ifdef TIMER3_IRQn
        case 3: return TIMER3_IRQn;
#endif
#ifdef TIMER4_IRQn
        case 4: return TIMER4_IRQn;
#endif
        default: return static_cast<IRQn_Type>(0);
    }
}

// Get max channels for timer instance
static u8 get_timer_max_channels(int index) FL_NO_EXCEPT {
    // TIMER0-2 have 4 channels, TIMER3-4 have 6 channels
    return (index >= 3) ? 6 : 4;
}

// Allocate a timer channel
static bool allocate_timer_channel(int& timer_idx, u8& channel) FL_NO_EXCEPT {
    for (int i = 0; i < MAX_TIMER_INSTANCES; i++) {
        u8 max_channels = get_timer_max_channels(i);
        for (u8 ch = 0; ch < max_channels; ch++) {
            if (!timer_allocated[i][ch]) {
                timer_allocated[i][ch] = true;
                timer_idx = i;
                channel = ch;
                return true;
            }
        }
    }
    return false;  // No free timer channels
}

// Free a timer channel
static void free_timer_channel(int timer_idx, u8 channel) FL_NO_EXCEPT {
    if (timer_idx >= 0 && timer_idx < MAX_TIMER_INSTANCES && channel < 6) {
        timer_allocated[timer_idx][channel] = false;
        timer_handles[timer_idx][channel] = nullptr;
    }
}

// Allocate a GPIOTE channel
static i8 allocate_gpiote_channel() FL_NO_EXCEPT {
    for (u8 i = 0; i < MAX_GPIOTE_CHANNELS; i++) {
        if (!gpiote_allocated[i]) {
            gpiote_allocated[i] = true;
            return i;
        }
    }
    return -1;  // No free GPIOTE channels
}

// Free a GPIOTE channel
static void free_gpiote_channel(i8 channel) FL_NO_EXCEPT {
    if (channel >= 0 && channel < MAX_GPIOTE_CHANNELS) {
        gpiote_allocated[channel] = false;
        gpiote_handles[channel] = nullptr;
    }
}

// Map ISR priority (1-7) to NVIC priority (0-7, lower = higher)
// ISR priority 1 (low) -> NVIC 6, ISR priority 2 -> NVIC 5, ..., ISR priority 7 (max) -> NVIC 2
// Reserve NVIC 0-1 for SoftDevice (BLE stack)
//
// SoftDevice Compatibility Notes (when BLE is enabled):
// - SoftDevice uses NVIC priorities 0, 1, and 4
// - Application can safely use priorities 2, 3, 5, 6, 7
// - Interrupts at priority 0-3 CANNOT call SoftDevice APIs (use defer to lower priority)
// - Interrupts at priority 5-7 CAN call SoftDevice APIs
// - When SoftDevice is enabled, use sd_nvic_* functions instead of NVIC_* functions
// - This implementation assumes NO SoftDevice (uses direct NVIC access)
static u8 map_priority_to_nvic(u8 isr_priority) FL_NO_EXCEPT {
    // Clamp to valid range
    if (isr_priority < 1) isr_priority = 1;
    if (isr_priority > 7) isr_priority = 7;

    // Map: ISR 1->NVIC 6, ISR 2->NVIC 5, ..., ISR 7->NVIC 2
    // This mapping avoids NVIC 0-1 (SoftDevice high priority) and NVIC 7 (lowest)
    return 8 - isr_priority;
}

// =============================================================================
// Timer ISR Handlers
// =============================================================================

// Map channel index to timer event enum
static nrf_timer_event_t get_timer_event(u8 channel) FL_NO_EXCEPT {
    // Use proper enum values defined by Nordic SDK (offsetof-based)
    switch (channel) {
        case 0: return NRF_TIMER_EVENT_COMPARE0;
        case 1: return NRF_TIMER_EVENT_COMPARE1;
        case 2: return NRF_TIMER_EVENT_COMPARE2;
        case 3: return NRF_TIMER_EVENT_COMPARE3;
#ifdef NRF_TIMER_EVENT_COMPARE4
        case 4: return NRF_TIMER_EVENT_COMPARE4;
#endif
#ifdef NRF_TIMER_EVENT_COMPARE5
        case 5: return NRF_TIMER_EVENT_COMPARE5;
#endif
        default: return NRF_TIMER_EVENT_COMPARE0;  // Fallback (should never happen)
    }
}

// Common timer interrupt handler
static void timer_interrupt_handler(int timer_idx, u8 channel) FL_NO_EXCEPT {
    NRF_TIMER_Type* timer = get_timer_instance(timer_idx);
    if (!timer) return;

    nrf_timer_event_t event = get_timer_event(channel);

    // Check if this channel triggered the interrupt
    if (nrf_timer_event_check(timer, event)) {
        nrf_timer_event_clear(timer, event);

        nrf52_isr_handle_data* handle = timer_handles[timer_idx][channel];
        if (handle && handle->user_handler) {
            handle->user_handler(handle->user_data);
        }
    }
}

// Map GPIOTE channel index to event enum
static fastled_nrf_gpiote_event_t get_gpiote_event(u8 channel) FL_NO_EXCEPT {
    if (channel >= MAX_GPIOTE_CHANNELS) {
        channel = 0;
    }
    // Both Nordic HAL generations define these enum values as register
    // offsets into the contiguous EVENTS_IN array.
#if FL_NRF52_USE_LEGACY_HAL
    return static_cast<fastled_nrf_gpiote_event_t>(
        NRF_GPIOTE_EVENTS_IN_0 + channel * sizeof(u32));
#else
    return static_cast<fastled_nrf_gpiote_event_t>(
        NRF_GPIOTE_EVENT_IN_0 + channel * sizeof(u32));
#endif
}

// Timer ISR wrappers for each instance
// Marked as weak to allow Arduino framework or user code to override
extern "C" {
    FL_LINK_WEAK void TIMER0_IRQHandler(void) FL_NO_EXCEPT {
        for (u8 ch = 0; ch < 4; ch++) {
            if (timer_handles[0][ch]) {
                timer_interrupt_handler(0, ch);
            }
        }
    }

    FL_LINK_WEAK void TIMER1_IRQHandler(void) FL_NO_EXCEPT {
        for (u8 ch = 0; ch < 4; ch++) {
            if (timer_handles[1][ch]) {
                timer_interrupt_handler(1, ch);
            }
        }
    }

    FL_LINK_WEAK void TIMER2_IRQHandler(void) FL_NO_EXCEPT {
        for (u8 ch = 0; ch < 4; ch++) {
            if (timer_handles[2][ch]) {
                timer_interrupt_handler(2, ch);
            }
        }
    }

#ifdef TIMER3_IRQn
    FL_LINK_WEAK void TIMER3_IRQHandler(void) FL_NO_EXCEPT {
        for (u8 ch = 0; ch < 6; ch++) {
            if (timer_handles[3][ch]) {
                timer_interrupt_handler(3, ch);
            }
        }
    }
#endif

#ifdef TIMER4_IRQn
    FL_LINK_WEAK void TIMER4_IRQHandler(void) FL_NO_EXCEPT {
        for (u8 ch = 0; ch < 6; ch++) {
            if (timer_handles[4][ch]) {
                timer_interrupt_handler(4, ch);
            }
        }
    }
#endif

    // GPIOTE handler - weak to allow Arduino framework (WInterrupts.c) to override
    FL_LINK_WEAK void GPIOTE_IRQHandler(void) FL_NO_EXCEPT {
        for (u8 ch = 0; ch < MAX_GPIOTE_CHANNELS; ch++) {
            fastled_nrf_gpiote_event_t event = get_gpiote_event(ch);

            if (fastled_gpiote_event_check(event) && gpiote_handles[ch]) {
                fastled_gpiote_event_clear(event);

