FastLED/FastLED/src/platforms/arm/nrf52/isr_nrf52.hpp
                if (gpiote_handles[ch]->user_handler) {
                    gpiote_handles[ch]->user_handler(gpiote_handles[ch]->user_data);
                }
            }
        }
    }
}

// =============================================================================
// NRF52 ISR Implementation (fl::isr::platform namespace)
// =============================================================================

int attach_timer_handler(const isr_config_t& config, isr_handle_t* out_handle) FL_NO_EXCEPT {
    if (!config.handler) {
        FL_WARN("attachTimerHandler: handler is null");
        return -1;  // Invalid parameter
    }

    if (config.frequency_hz == 0) {
        FL_WARN("attachTimerHandler: frequency_hz is 0");
        return -2;  // Invalid frequency
    }

    // Allocate a free timer channel
    int timer_idx = -1;
    u8 channel = 0;
    if (!allocate_timer_channel(timer_idx, channel)) {
        FL_WARN("attachTimerHandler: no free timer channels");
        return -3;  // Out of resources
    }

    NRF_TIMER_Type* timer = get_timer_instance(timer_idx);
    if (!timer) {
        free_timer_channel(timer_idx, channel);
        FL_WARN("attachTimerHandler: invalid timer instance");
        return -4;  // Internal error
    }

    // Allocate handle data
    auto handle_owner = fl::make_unique<nrf52_isr_handle_data>();
    auto* handle_data = handle_owner.get();
    if (!handle_data) {
        free_timer_channel(timer_idx, channel);
        FL_WARN("attachTimerHandler: failed to allocate handle data");
        return -5;  // Out of memory
    }

    handle_data->is_timer = true;
    handle_data->timer_instance = timer;
    handle_data->timer_channel = channel;
    handle_data->timer_irq = get_timer_irq(timer_idx);
    handle_data->user_handler = config.handler;
    handle_data->user_data = config.user_data;

    // Store handle for ISR access
    timer_handles[timer_idx][channel] = handle_data;

    // Configure timer (only if this is the first channel on this timer)
    // WARNING: Timer configuration is shared across all channels on the same timer instance
    // Reconfiguring an already-running timer could affect other active channels
    bool timer_already_running = false;
    for (u8 ch = 0; ch < get_timer_max_channels(timer_idx); ch++) {
        if (ch != channel && timer_allocated[timer_idx][ch]) {
            timer_already_running = true;
            break;
        }
    }

    if (!timer_already_running) {
        nrf_timer_mode_set(timer, NRF_TIMER_MODE_TIMER);
        nrf_timer_bit_width_set(timer, NRF_TIMER_BIT_WIDTH_32);
    }

    // Choose frequency based on requested timer frequency
    // NRF52 timer can run at: 16MHz, 8MHz, 4MHz, 2MHz, 1MHz, 500kHz, 250kHz, 125kHz, 62.5kHz, 31.25kHz
    // WARNING: Frequency is shared across all channels on the same timer instance
    nrf_timer_frequency_t timer_freq;
    if (config.frequency_hz >= 1000000) {
        timer_freq = NRF_TIMER_FREQ_16MHz;  // 16 MHz for high-frequency timers
    } else if (config.frequency_hz >= 100000) {
        timer_freq = NRF_TIMER_FREQ_1MHz;   // 1 MHz for mid-range
    } else if (config.frequency_hz >= 10000) {
        timer_freq = NRF_TIMER_FREQ_125kHz; // 125 kHz for low-frequency
    } else {
        timer_freq = NRF_TIMER_FREQ_31250Hz; // 31.25 kHz for very low frequency
    }

    if (!timer_already_running) {
        nrf_timer_frequency_set(timer, timer_freq);
    }

    // Calculate compare value based on timer frequency
    u32 timer_base_freq;
    switch (timer_freq) {
        case NRF_TIMER_FREQ_16MHz:   timer_base_freq = 16000000; break;
        case NRF_TIMER_FREQ_8MHz:    timer_base_freq = 8000000; break;
        case NRF_TIMER_FREQ_4MHz:    timer_base_freq = 4000000; break;
        case NRF_TIMER_FREQ_2MHz:    timer_base_freq = 2000000; break;
        case NRF_TIMER_FREQ_1MHz:    timer_base_freq = 1000000; break;
        case NRF_TIMER_FREQ_500kHz:  timer_base_freq = 500000; break;
        case NRF_TIMER_FREQ_250kHz:  timer_base_freq = 250000; break;
        case NRF_TIMER_FREQ_125kHz:  timer_base_freq = 125000; break;
        case NRF_TIMER_FREQ_62500Hz: timer_base_freq = 62500; break;
        case NRF_TIMER_FREQ_31250Hz: timer_base_freq = 31250; break;
        default: timer_base_freq = 1000000; break;
    }

    u32 compare_value = timer_base_freq / config.frequency_hz;
    if (compare_value == 0) {
        compare_value = 1;  // Minimum value
    }

    // Set compare value using nrf_timer_cc_channel_t enum
    // SDK provides NRF_TIMER_CC_CHANNEL0..5 as the proper channel type
    nrf_timer_cc_channel_t cc_channel = static_cast<nrf_timer_cc_channel_t>(NRF_TIMER_CC_CHANNEL0 + channel);
    fastled_timer_cc_set(timer, cc_channel, compare_value);

    // Enable auto-reload unless one-shot mode requested
    if (!(config.flags & ISR_FLAG_ONE_SHOT)) {
        nrf_timer_shorts_enable(timer,
            static_cast<u32>(NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK << channel));
    }

    // Enable interrupt for this channel
    nrf_timer_int_enable(timer,
        static_cast<u32>(NRF_TIMER_INT_COMPARE0_MASK << channel));

    // Set NVIC priority and enable IRQ
    u8 nvic_priority = map_priority_to_nvic(config.priority);
    NVIC_SetPriority(handle_data->timer_irq, nvic_priority);
    NVIC_EnableIRQ(handle_data->timer_irq);

    // Start timer (only if not already running)
    if (!timer_already_running) {
        nrf_timer_task_trigger(timer, NRF_TIMER_TASK_START);
    }

    FL_DBG("Timer started at %s Hz on TIMER%s channel %s", config.frequency_hz, timer_idx, static_cast<int>(channel));

    // Release ownership - pointer is now managed by the C API (timer_handles + out_handle)
    handle_owner.release();

    // Populate output handle
    if (out_handle) {
        out_handle->platform_handle = handle_data;
        out_handle->handler = config.handler;
        out_handle->user_data = config.user_data;
        out_handle->platform_id = NRF52_PLATFORM_ID;
    }

    return 0;  // Success
}

int attach_external_handler(u8 pin, const isr_config_t& config, isr_handle_t* out_handle) FL_NO_EXCEPT {
    if (!config.handler) {
        FL_WARN("attachExternalHandler: handler is null");
        return -1;  // Invalid parameter
    }

