FastLED/FastLED/src/platforms/arm/nrf52/isr_nrf52.hpp
    // Allocate a GPIOTE channel
    i8 gpiote_ch = allocate_gpiote_channel();
    if (gpiote_ch < 0) {
        FL_WARN("attachExternalHandler: no free GPIOTE channels");
        return -3;  // Out of resources
    }

    // Allocate handle data
    auto handle_owner = fl::make_unique<nrf52_isr_handle_data>();
    auto* handle_data = handle_owner.get();
    if (!handle_data) {
        free_gpiote_channel(gpiote_ch);
        FL_WARN("attachExternalHandler: failed to allocate handle data");
        return -5;  // Out of memory
    }

    handle_data->is_timer = false;
    handle_data->gpiote_channel = gpiote_ch;
    handle_data->gpio_pin = pin;
    handle_data->user_handler = config.handler;
    handle_data->user_data = config.user_data;

    // Store handle for ISR access
    gpiote_handles[gpiote_ch] = handle_data;

    // Configure GPIO pin as input
    nrf_gpio_cfg_input(pin, NRF_GPIO_PIN_NOPULL);

    // Determine GPIOTE polarity from flags
    nrf_gpiote_polarity_t polarity;
    if (config.flags & ISR_FLAG_EDGE_RISING) {
        polarity = NRF_GPIOTE_POLARITY_LOTOHI;
    } else if (config.flags & ISR_FLAG_EDGE_FALLING) {
        polarity = NRF_GPIOTE_POLARITY_HITOLO;
    } else {
        polarity = NRF_GPIOTE_POLARITY_TOGGLE;  // Default to both edges
    }

    // Configure GPIOTE channel
    fastled_gpiote_event_configure(static_cast<u32>(gpiote_ch), pin, polarity);
    fastled_gpiote_event_enable(static_cast<u32>(gpiote_ch));

    // Enable GPIOTE interrupt
    fastled_gpiote_int_enable(1U << gpiote_ch);

    // Set NVIC priority and enable IRQ
    u8 nvic_priority = map_priority_to_nvic(config.priority);
    NVIC_SetPriority(GPIOTE_IRQn, nvic_priority) FL_NO_EXCEPT;
    NVIC_EnableIRQ(GPIOTE_IRQn) FL_NO_EXCEPT;

    FL_DBG("GPIO interrupt attached on pin %s GPIOTE channel %s", static_cast<int>(pin), static_cast<int>(gpiote_ch));

    // Release ownership - pointer is now managed by the C API (gpiote_handles + out_handle)
    handle_owner.release();

    // Populate output handle
    if (out_handle) {
        out_handle->platform_handle = handle_data;
        out_handle->handler = config.handler;
        out_handle->user_data = config.user_data;
        out_handle->platform_id = NRF52_PLATFORM_ID;
    }

    return 0;  // Success
}

int detach_handler(isr_handle_t& handle) FL_NO_EXCEPT {
    if (!handle.is_valid() || handle.platform_id != NRF52_PLATFORM_ID) {
        FL_WARN("detachHandler: invalid handle");
        return -1;  // Invalid handle
    }

    nrf52_isr_handle_data* handle_data = static_cast<nrf52_isr_handle_data*>(handle.platform_handle);
    if (!handle_data) {
        FL_WARN("detachHandler: null handle data");
        return -1;  // Invalid handle
    }

    if (handle_data->is_timer) {
        // Disable timer interrupt
        int timer_idx = get_timer_index(handle_data->timer_instance);
        if (timer_idx >= 0) {
            nrf_timer_int_disable(handle_data->timer_instance,
                static_cast<u32>(NRF_TIMER_INT_COMPARE0_MASK << handle_data->timer_channel));

            free_timer_channel(timer_idx, handle_data->timer_channel);
        }
    } else {
        // Disable GPIOTE interrupt
        if (handle_data->gpiote_channel >= 0) {
            fastled_gpiote_event_disable(static_cast<u32>(handle_data->gpiote_channel));
            fastled_gpiote_int_disable(1U << handle_data->gpiote_channel);

            free_gpiote_channel(handle_data->gpiote_channel);
        }
    }

    delete handle_data;  // ok bare allocation (C API teardown)
    handle.platform_handle = nullptr;
    handle.platform_id = 0;

    FL_DBG("Handler detached");
    return 0;  // Success
}

int enable_handler(const isr_handle_t& handle) FL_NO_EXCEPT {
    if (!handle.is_valid() || handle.platform_id != NRF52_PLATFORM_ID) {
        FL_WARN("enableHandler: invalid handle");
        return -1;  // Invalid handle
    }

    nrf52_isr_handle_data* handle_data = static_cast<nrf52_isr_handle_data*>(handle.platform_handle);
    if (!handle_data) {
        FL_WARN("enableHandler: null handle data");
        return -1;  // Invalid handle
    }

    if (handle_data->is_timer) {
        nrf_timer_int_enable(handle_data->timer_instance,
            static_cast<u32>(NRF_TIMER_INT_COMPARE0_MASK << handle_data->timer_channel));
        handle_data->is_enabled = true;
    } else {
        fastled_gpiote_event_enable(static_cast<u32>(handle_data->gpiote_channel));
        fastled_gpiote_int_enable(1U << handle_data->gpiote_channel);
        handle_data->is_enabled = true;
    }

    return 0;  // Success
}

int disable_handler(const isr_handle_t& handle) FL_NO_EXCEPT {
    if (!handle.is_valid() || handle.platform_id != NRF52_PLATFORM_ID) {
        FL_WARN("disableHandler: invalid handle");
        return -1;  // Invalid handle
    }

    nrf52_isr_handle_data* handle_data = static_cast<nrf52_isr_handle_data*>(handle.platform_handle);
    if (!handle_data) {
        FL_WARN("disableHandler: null handle data");
        return -1;  // Invalid handle
    }

    if (handle_data->is_timer) {
        nrf_timer_int_disable(handle_data->timer_instance,
            static_cast<u32>(NRF_TIMER_INT_COMPARE0_MASK << handle_data->timer_channel));
        handle_data->is_enabled = false;
    } else {
        fastled_gpiote_event_disable(static_cast<u32>(handle_data->gpiote_channel));
        fastled_gpiote_int_disable(1U << handle_data->gpiote_channel);
        handle_data->is_enabled = false;
    }

    return 0;  // Success
}

bool is_handler_enabled(const isr_handle_t& handle) FL_NO_EXCEPT {
    if (!handle.is_valid() || handle.platform_id != NRF52_PLATFORM_ID) {
        return false;
    }

    nrf52_isr_handle_data* handle_data = static_cast<nrf52_isr_handle_data*>(handle.platform_handle);
    if (!handle_data) {
        return false;
    }

    return handle_data->is_enabled;
}

const char* get_error_string(int error_code) FL_NO_EXCEPT {
    switch (error_code) {
        case 0: return "Success";
        case -1: return "Invalid parameter";
        case -2: return "Invalid frequency";
        case -3: return "Out of resources";
        case -4: return "Internal error";
        case -5: return "Out of memory";
        default: return "Unknown error";
    }
}

const char* get_platform_name() FL_NO_EXCEPT {
#if defined(FL_IS_NRF52840)
    return "NRF52840";
#elif defined(FL_IS_NRF52833)
    return "NRF52833";
#elif defined(FL_IS_NRF52832)
    return "NRF52832";
#else
    return "NRF52";
#endif
}

u32 get_max_timer_frequency() FL_NO_EXCEPT {
    return 16000000;  // 16 MHz (maximum timer frequency)
}

u32 get_min_timer_frequency() FL_NO_EXCEPT {
    return 1;  // 1 Hz (practical minimum)
}

u8 get_max_priority() FL_NO_EXCEPT {
    // Return 7 (highest user priority in ISR numbering)
    // Note: NVIC priorities 0-1 reserved for SoftDevice when BLE is active
    return 7;
}

bool requires_assembly_handler(u8 priority) FL_NO_EXCEPT {
    // ARM Cortex-M4F: All priority levels support C handlers
    (void)priority;
    return false;
}

} // namespace platforms
} // namespace isr

// =============================================================================
// Global Interrupt Control (noInterrupts/interrupts)
// =============================================================================

/// Disable interrupts on ARM Cortex-M (NRF52)
inline void interruptsDisable() FL_NO_EXCEPT {
    __asm__ __volatile__("cpsid i" ::: "memory") FL_NO_EXCEPT;
}

/// Enable interrupts on ARM Cortex-M (NRF52)
inline void interruptsEnable() FL_NO_EXCEPT {
    __asm__ __volatile__("cpsie i" ::: "memory") FL_NO_EXCEPT;
}

} // namespace fl

#endif // FL_IS_NRF52
